# **The Analysis of Sales Dataset**

## **About Data**

Title       : Sales Dataset

Dataset     : [link](https://www.kaggle.com/datasets/sahilislam007/sales-dataset)

## **Import Libraries**

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## **Data Exploration**

### **Download and Load CSV**

In [2]:
# Download csv

import kagglehub

path = kagglehub.dataset_download("sahilislam007/sales-dataset")

In [3]:
# Load csv
df = pd.read_csv(path + "/Sales Dataset.csv")

### **Sneak Peak Data**

In [4]:
# See the top 5 of the data
df.head()

,Unnamed: 0,Date,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,0,2023-11-24,Male,34,Beauty,3,50,150
1,1,2023-02-27,Female,26,Clothing,2,500,1000
2,2,2023-01-13,Male,50,Electronics,1,30,30
3,3,2023-05-21,Male,37,Clothing,1,500,500
4,4,2023-05-06,Male,30,Beauty,2,50,100

In [5]:
# See the columns name
df.columns

Index(['Unnamed: 0', 'Date', 'Gender', 'Age', 'Product Category', 'Quantity',
       'Price per Unit', 'Total Amount'],
      dtype='object')

In [6]:
# See the data's shape
print(f"There are {df.shape[0]} rows and {df.shape[1]} columns")

There are 1000 rows and 8 columns

In [7]:
# See the columns details
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        1000 non-null   int64
 1   Date              1000 non-null   object
 2   Gender            1000 non-null   object
 3   Age               1000 non-null   int64
 4   Product Category  1000 non-null   object
 5   Quantity          1000 non-null   int64
 6   Price per Unit    1000 non-null   int64
 7   Total Amount      1000 non-null   int64
dtypes: int64(5), object(3)
memory usage: 62.6+ KB

In [8]:
# Count null values
df.isna().sum()

Unnamed: 0          0
Date                0
Gender              0
Age                 0
Product Category    0
Quantity            0
Price per Unit      0
Total Amount        0
dtype: int64

### **Findings**
1. There are 1000 rows and 8 columns
2. The columns of the dataset are: 
      
      (['Unnamed: 0', 'Date', 'Gender', 'Age', 'Product Category', 'Quantity',
       'Price per Unit', 'Total Amount'])
3. There are some columns that have wrong datatype
4. There is no missing or null value 
5. There is a unknown column's name

### **Change Column Name**

In [9]:
# Copy the original table
df_sales = df.copy()

In [10]:
# Changing unknown column's name
df_sales.rename(columns={'Unnamed: 0' : 'Row Number'}, inplace=True)

In [11]:
# Check changing
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Row Number        1000 non-null   int64
 1   Date              1000 non-null   object
 2   Gender            1000 non-null   object
 3   Age               1000 non-null   int64
 4   Product Category  1000 non-null   object
 5   Quantity          1000 non-null   int64
 6   Price per Unit    1000 non-null   int64
 7   Total Amount      1000 non-null   int64
dtypes: int64(5), object(3)
memory usage: 62.6+ KB

### **Change Columns Datatype**

In [12]:
# Change Date column datatype from object to datetime
df_sales['Date'] = pd.to_datetime(df_sales['Date'])

In [13]:
# Check changing
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Row Number        1000 non-null   int64
 1   Date              1000 non-null   datetime64[ns]
 2   Gender            1000 non-null   object
 3   Age               1000 non-null   int64
 4   Product Category  1000 non-null   object
 5   Quantity          1000 non-null   int64
 6   Price per Unit    1000 non-null   int64
 7   Total Amount      1000 non-null   int64
dtypes: datetime64[ns](1), int64(5), object(2)
memory usage: 62.6+ KB

### **Change Column Values**
The row number start with 0, so I want to change the number with +1 for all the row number

In [14]:
# Change row number values
df_sales['Row Number'] = df_sales['Row Number'] + 1

In [15]:
# Check row number changing
df_sales.head()

,Row Number,Date,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,Male,34,Beauty,3,50,150
1,2,2023-02-27,Female,26,Clothing,2,500,1000
2,3,2023-01-13,Male,50,Electronics,1,30,30
3,4,2023-05-21,Male,37,Clothing,1,500,500
4,5,2023-05-06,Male,30,Beauty,2,50,100

### **Check Other Columns For Possible Error**

In [16]:
# Check the unique values in gender column
df_sales['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [17]:
# Check the unique values in age column
df_sales['Age'].unique()

array([34, 26, 50, 37, 30, 45, 46, 63, 52, 23, 35, 22, 64, 42, 19, 27, 47,
       62, 18, 49, 28, 38, 43, 39, 44, 51, 58, 48, 55, 20, 40, 54, 36, 31,
       21, 57, 25, 56, 29, 61, 32, 41, 59, 60, 33, 53, 24])

In [18]:
# Check the unique values in product category column
df_sales['Product Category'].unique()

array(['Beauty', 'Clothing', 'Electronics'], dtype=object)

### **Duplicates**

In [19]:
# Show duplicate
df_sales_duplicate = df_sales.duplicated()

In [20]:
# Show all duplicates
print(df_sales_duplicate)

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

## **Data Transformation**

In [21]:
df_sales.head()

,Row Number,Date,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,Male,34,Beauty,3,50,150
1,2,2023-02-27,Female,26,Clothing,2,500,1000
2,3,2023-01-13,Male,50,Electronics,1,30,30
3,4,2023-05-21,Male,37,Clothing,1,500,500
4,5,2023-05-06,Male,30,Beauty,2,50,100

### **Add Days Name Columns**

In [22]:
# Add days name
df_sales['Day'] = df_sales['Date'].dt.day_name()

In [23]:
# Check the new column
df_sales.head()

,Row Number,Date,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Day
0,1,2023-11-24,Male,34,Beauty,3,50,150,Friday
1,2,2023-02-27,Female,26,Clothing,2,500,1000,Monday
2,3,2023-01-13,Male,50,Electronics,1,30,30,Friday
3,4,2023-05-21,Male,37,Clothing,1,500,500,Sunday
4,5,2023-05-06,Male,30,Beauty,2,50,100,Saturday

### **Add Age Segment Column**

In [24]:
# Add age segment column
df_sales['Age Segment'] = np.where(df_sales['Age'] <= 17, 'Youth',
                            np.where(df_sales['Age'] <= 34, 'Young Adult',
                            np.where(df_sales['Age'] <= 54, 'Adult','Senior')))

In [25]:
# Check the new column
df_sales.head()

,Row Number,Date,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Day,Age Segment
0,1,2023-11-24,Male,34,Beauty,3,50,150,Friday,Young Adult
1,2,2023-02-27,Female,26,Clothing,2,500,1000,Monday,Young Adult
2,3,2023-01-13,Male,50,Electronics,1,30,30,Friday,Adult
3,4,2023-05-21,Male,37,Clothing,1,500,500,Sunday,Adult
4,5,2023-05-06,Male,30,Beauty,2,50,100,Saturday,Young Adult

### **Add Month and Monthly Sales Columns**

In [26]:
# Add month column
df_sales['Month'] = df_sales['Date'].dt.to_period('M')

In [27]:
# Check new column
df_sales.head()

,Row Number,Date,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Day,Age Segment,Month
0,1,2023-11-24,Male,34,Beauty,3,50,150,Friday,Young Adult,2023-11
1,2,2023-02-27,Female,26,Clothing,2,500,1000,Monday,Young Adult,2023-02
2,3,2023-01-13,Male,50,Electronics,1,30,30,Friday,Adult,2023-01
3,4,2023-05-21,Male,37,Clothing,1,500,500,Sunday,Adult,2023-05
4,5,2023-05-06,Male,30,Beauty,2,50,100,Saturday,Young Adult,2023-05

In [28]:
# Add monthly sales column
df_sales['Monthly Sales'] = df_sales.groupby('Month')['Total Amount'].transform('sum')

In [29]:
# Check new column
df_sales.head()

,Row Number,Date,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Day,Age Segment,Month,Monthly Sales
0,1,2023-11-24,Male,34,Beauty,3,50,150,Friday,Young Adult,2023-11,34920
1,2,2023-02-27,Female,26,Clothing,2,500,1000,Monday,Young Adult,2023-02,44060
2,3,2023-01-13,Male,50,Electronics,1,30,30,Friday,Adult,2023-01,35450
3,4,2023-05-21,Male,37,Clothing,1,500,500,Sunday,Adult,2023-05,53150
4,5,2023-05-06,Male,30,Beauty,2,50,100,Saturday,Young Adult,2023-05,53150

### **Add Quarter and Quarter Sales Columns**

In [30]:
# Add quarter column
df_sales['Quarter'] = 'Q' + df_sales['Date'].dt.quarter.astype(str)

In [31]:
# Check new column
df_sales.head()

,Row Number,Date,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Day,Age Segment,Month,Monthly Sales,Quarter
0,1,2023-11-24,Male,34,Beauty,3,50,150,Friday,Young Adult,2023-11,34920,Q4
1,2,2023-02-27,Female,26,Clothing,2,500,1000,Monday,Young Adult,2023-02,44060,Q1
2,3,2023-01-13,Male,50,Electronics,1,30,30,Friday,Adult,2023-01,35450,Q1
3,4,2023-05-21,Male,37,Clothing,1,500,500,Sunday,Adult,2023-05,53150,Q2
4,5,2023-05-06,Male,30,Beauty,2,50,100,Saturday,Young Adult,2023-05,53150,Q2

In [32]:
# Add quarter sales column
df_sales['Quarter Sales'] = df_sales.groupby('Quarter')['Total Amount'].transform('sum')

In [33]:
# Check new column
df_sales.head()

,Row Number,Date,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Day,Age Segment,Month,Monthly Sales,Quarter,Quarter Sales
0,1,2023-11-24,Male,34,Beauty,3,50,150,Friday,Young Adult,2023-11,34920,Q4,126190
1,2,2023-02-27,Female,26,Clothing,2,500,1000,Monday,Young Adult,2023-02,44060,Q1,110030
2,3,2023-01-13,Male,50,Electronics,1,30,30,Friday,Adult,2023-01,35450,Q1,110030
3,4,2023-05-21,Male,37,Clothing,1,500,500,Sunday,Adult,2023-05,53150,Q2,123735
4,5,2023-05-06,Male,30,Beauty,2,50,100,Saturday,Young Adult,2023-05,53150,Q2,123735

### **Add Monthly Growth Percentation**

In [ ]:
# Rearrange rows based on oldest date
df_sales = df_sales.sort_values(by='Date', ascending=True)

In [ ]:
# Because of the rearrange rows, row number become random
# So, I reset the row number 
df_sales['Row Number'] = df_sales.index + 1

In [41]:
# Check changing
df_sales.head()

,Row Number,Date,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Day,Age Segment,Month,Monthly Sales,Quarter,Quarter Sales
0,1,2023-01-01,Male,46,Beauty,3,500,1500,Sunday,Adult,2023-01,35450,Q1,110030
1,2,2023-01-01,Male,41,Clothing,3,300,900,Sunday,Adult,2023-01,35450,Q1,110030
2,3,2023-01-01,Female,40,Clothing,4,300,1200,Sunday,Adult,2023-01,35450,Q1,110030
3,4,2023-01-02,Male,19,Electronics,3,30,90,Monday,Young Adult,2023-01,35450,Q1,110030
4,5,2023-01-02,Female,19,Beauty,1,25,25,Monday,Young Adult,2023-01,35450,Q1,110030

1. Rearrange rows based date
2. Search %growth = (thismonth - lastmonth)/lastmonth
3. lastmonth using .shift()
4. create pivot table
    - Age segment behavior (total spending, product category, when)
    - weekly, monthly, and quarter customer behavior
    - Gender spending behavior